; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v2 - type_1 ?v8 - type_3)
 	      (pred_2 ?v1 - object ?v8 - type_3)
	      (pred_1 ?v2 - type_1 ?v3 - type_2)
	      (pred_4 ?v2 - type_1 ?v1 - object ?v3 - type_2))

   (:action op_2
       :parameters  (?v2 - type_1 ?v6 ?v4 - type_3)
       :precondition (and  (pred_3 ?v2 ?v6))
       :effect (and  (pred_3 ?v2 ?v4)
		     (not (pred_3 ?v2 ?v6))))

   (:action op_1
       :parameters (?v2 - type_1 ?v5 - object ?v7 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v7) (pred_3 ?v2 ?v7) (pred_1 ?v2 ?v3))
       :effect (and (pred_4 ?v2 ?v5 ?v3)
		    (not (pred_2 ?v5 ?v7)) 
		    (not (pred_1 ?v2 ?v3))))

   (:action op_3
       :parameters (?v2 - type_1 ?v5 - object ?v7 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v5 ?v3) (pred_3 ?v2 ?v7))
       :effect (and (pred_2 ?v5 ?v7)
		    (pred_1 ?v2 ?v3)
		    (not (pred_4 ?v2 ?v5 ?v3)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_08 obj_12 - type_1
obj_10 obj_07 obj_02 obj_05 - type_2
obj_06 obj_03 obj_04 - type_3
obj_01 obj_09 obj_11 - object)
(:init
(pred_3 obj_08 obj_03)
(pred_1 obj_08 obj_10)
(pred_1 obj_08 obj_07)
(pred_3 obj_12 obj_03)
(pred_1 obj_12 obj_02)
(pred_1 obj_12 obj_05)
(pred_2 obj_01 obj_06)
(pred_2 obj_09 obj_06)
(pred_2 obj_11 obj_04)
)
(:goal
(and
(pred_2 obj_01 obj_04)
(pred_2 obj_09 obj_06)
(pred_2 obj_11 obj_03)
)
)

(:constraints
  (always (not (pred_3 obj_08 obj_04)))
)
)

; plan
1. (op_2 obj_08 obj_03 obj_06)
   deleted: (pred_3 obj_08 obj_03)
   added: (pred_3 obj_08 obj_06)
   goals met: 1 of 3
2. (op_2 obj_12 obj_03 obj_04)
   deleted: (pred_3 obj_12 obj_03)
   added: (pred_3 obj_12 obj_04)
   goals met: 1 of 3
3. (op_1 obj_08 obj_01 obj_06 obj_07)
   deleted: (pred_2 obj_01 obj_06) (pred_1 obj_08 obj_07)
   added: (pred_4 obj_08 obj_01 obj_07)
   goals met: 1 of 3
4. (op_1 obj_12 obj_11 obj_04 obj_05)
   deleted: (pred_2 obj_11 obj_04) (pred_1 obj_12 obj_05)
   added: (pred_4 obj_12 obj_11 obj_05)
   goals met: 1 of 3
5. (op_2 obj_12 obj_04 obj_03)
   deleted: (pred_3 obj_12 obj_04)
   added: (pred_3 obj_12 obj_03)
   goals met: 1 of 3
6. (op_3 obj_08 obj_01 obj_06 obj_07)
   deleted: (pred_4 obj_08 obj_01 obj_07)
   added: (pred_2 obj_01 obj_06) (pred_1 obj_08 obj_07)
   goals met: 1 of 3
7. (op_3 obj_12 obj_11 obj_03 obj_05)
   deleted: (pred_4 obj_12 obj_11 obj_05)
   added: (pred_2 obj_11 obj_03) (pred_1 obj_12 obj_05)
   goals met: 2 of 3
8. (op_2 obj_12 obj_03 obj_06)
   deleted: (pred_3 obj_12 obj_03)
   added: (pred_3 obj_12 obj_06)
   goals met: 2 of 3
9. (op_1 obj_12 obj_01 obj_06 obj_05)
   deleted: (pred_2 obj_01 obj_06) (pred_1 obj_12 obj_05)
   added: (pred_4 obj_12 obj_01 obj_05)
   goals met: 2 of 3
10. (op_2 obj_12 obj_06 obj_04)
   deleted: (pred_3 obj_12 obj_06)
   added: (pred_3 obj_12 obj_04)
   goals met: 2 of 3
11. (op_3 obj_12 obj_01 obj_04 obj_05)
   deleted: (pred_4 obj_12 obj_01 obj_05)
   added: (pred_2 obj_01 obj_04) (pred_1 obj_12 obj_05)
   goals met: 3 of 3
